RT32024TEST.ОбменМагистральБП/src/DataProcessors/МС_ВыгрузкаПриходнойНакладнойВБП/МС_ВыгрузкаПриходнойНакладнойВБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МС_ВыгрузкаПриходнойНакладнойВБП</name>
  <attributes>
    <name>СсылкаНаДокумент</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗапасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураБП</name>
      <type>
        <types>CatalogRef.МС_НоменклатураБП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RT32024TEST.ОбменМагистральБП/src/DataProcessors/МС_ВыгрузкаПриходнойНакладнойВБП/Forms/Форма/Module.bsl
&НаСервере
Процедура ПодобратьНоменклатуруБПНаСервере()
	
	Для каждого СтрокаЗапасы Из Объект.ТабличнаяЧастьЗапасы Цикл
		Если ЗначениеЗаполнено(СтрокаЗапасы.НоменклатураБП) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПоиска = СтрокаЗапасы.Номенклатура.Наименование;
		Нашли = МС_ОбщийМодульПоиска.НайтиНоменклатуруПолнотекстово(СтрокаПоиска, 1);
		Если Нашли.Количество() > 0 Тогда
			СтрокаЗапасы.НоменклатураБП = Нашли[0];
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗапасы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.Номенклатура.МС_НоменклатураБП КАК НоменклатураБП
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", Объект.СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.ТабличнаяЧастьЗапасы.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		НоваяСтрока.НоменклатураБП = ВыборкаДетальныеЗаписи.НоменклатураБП;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СсылкаНаДокумент = Параметры.СсылкаНаДокумент; 
	ЗаполнитьТабличнуюЧастьЗапасы();
	ПодобратьНоменклатуруБПНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	РеквизитФормыВЗначение("Объект").ОтправитьПриходнуюНакладную();	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствиеВНоменклатуру()
	Для каждого СтрокаЗапасы Из Объект.ТабличнаяЧастьЗапасы Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗапасы.НоменклатураБП) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаЗапасы.Номенклатура.МС_НоменклатураБП = СтрокаЗапасы.НоменклатураБП Тогда
			Продолжить;
		КонецЕсли;
		
		Номенклатура = СтрокаЗапасы.Номенклатура.ПолучитьОбъект();	
		Номенклатура.МС_НоменклатураБП = СтрокаЗапасы.НоменклатураБП;
		Номенклатура.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ЗаписатьСоответствиеВНоменклатуру();
	ОтправитьНаСервере();
КонецПроцедуры
